app/Controllers/AchatController.php

     public function index()
    {
        if (! session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Récupérer depuis GET ou session
        $caisse_id = $this->request->getGet('caisse') ?? session()->get('caisse_id');

        if (!$caisse_id) {
            return redirect()->to('/caisse');
        }

        // Stocker en session
        session()->set('caisse_id', $caisse_id);

        $caisseModel = new CaisseModel();
        $achatModel = new AchatModel();
        $produitModel = new ProduitModel();

        $caisse = $caisseModel->find($caisse_id);
        $achats = $achatModel->getAchatProduit($caisse_id);
        $produits = $produitModel->findAll();
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '1'
SELECT *
FROM `produit`