app/Controllers/MvmntController.php

INSERT INTO `mouvement` (`id_operation`, `id_type_mouvement`, `montant`) VALUES (8, 2, 10000)
---
            ]);
        } elseif ($nomOperation === 'Retrait') {
            // L'argent sort : un seul débit chez le client (montant + frais)
            $mvmntModel->insert([
                'id_operation'      => $idOperation,
                'id_type_mouvement' => $idTypeDebit,
                'montant'           => $montantTotal,
            ]);