app/Controllers/MvmntController.php

    try {

        // Depot = type_operation 1
        $idOperation = $operationModel->insert([
            'id_type_operation'=>1,
            'client_source'=>null,
            'client_destination'=>$idClient,
            'montant'=>$montant,
            'frais'=>0
        ],true);
---
INSERT INTO `operation` (`id_type_operation`, `client_source`, `client_destination`, `montant`, `frais`) VALUES (1, NULL, 1, 10000, 0)



        // Création opération
        $idOperation = $operationModel->insert([

            'id_type_operation'=>2,
            'client_source'=>$idClient,
            'client_destination'=>null,
            'montant'=>$montant,
            'frais'=>$frais

        ], true);
---
INSERT INTO `operation` (`id_type_operation`, `client_source`, `client_destination`, `montant`, `frais`) VALUES (2, 1, NULL, 500, 25)

        // Création opération
        // Transfert = id_type_operation 3

        $idOperation = $operationModel->insert([

            'id_type_operation'=>3,

            'client_source'=>$idClientSource,

            'client_destination'=>$idClientDestinataire,

            'montant'=>$montant,

            'frais'=>0

        ], true);
---
INSERT INTO `operation` (`id_type_operation`, `client_source`, `client_destination`, `montant`, `frais`) VALUES (3, 1, 2, 500, 0)