app/Controllers/OperateurController.php

SELECT COUNT(*) AS `numrows` FROM `client`
SELECT COUNT(*) AS `numrows` FROM `operation`
---
    public function dashboard()
    {

        $operationModel = new OperationModel();
        $clientModel    = new ClientModel();


        $data = [

            'nombreClients' => $clientModel->countAll(),

            'nombreOperations' => $operationModel->countAll(),

SELECT *
FROM `client`
---
    public function clients()
    {

        $clientModel = new ClientModel();


        $data = [

            'clients' => $clientModel->findAll()

SELECT *
FROM `operateur`
---
    public function operateurs()
    {
    $operateurModel = new OperateurModel();

    $data = [
        'operateurs' => $operateurModel->findAll()
    ];