app/Models/AchatModel.php

SELECT `achat`.*, `produit`.`designation`, `produit`.`prix` AS `prix_unitaire`
FROM `achat`
JOIN `produit` ON `produit`.`id` = `achat`.`produit_id`
WHERE `achat`.`caisse_id` = '1'
---
    public function getAchatProduit($caisse_id = null)
    {
        $caisse_id = $caisse_id ?? session()->get('caisse_id');

        return $this->select('achat.*, produit.designation, produit.prix AS prix_unitaire')
            ->join('produit', 'produit.id = achat.produit_id')
            ->where('achat.caisse_id', $caisse_id)
            ->findAll();