app/Models/BaremeFraisModel.php

SELECT *
FROM `bareme_frais`
WHERE `id_type_operation` = 3
AND `montant_min` <= 2000
AND `montant_max` >= 2000
 LIMIT 1
---
    public function trouverBareme(int $idTypeOperation, int $montant): ?array
    {
        return $this->where('id_type_operation', $idTypeOperation)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->first();

SELECT `bareme_frais`.*, `type_operation`.`nom` AS `type_operation`
FROM `bareme_frais`
JOIN `type_operation` ON `type_operation`.`id` = `bareme_frais`.`id_type_operation`
---
    public function listeBaremes()
    {
    return $this->select('
            bareme_frais.*,
            type_operation.nom AS type_operation
        ')
        ->join(
            'type_operation',
            'type_operation.id = bareme_frais.id_type_operation'
        );