app/Models/ClientModel.php

    public function getIdByTelephone(string $telephone): ?int
{
    $client = $this->where('telephone', $telephone)->first();
---
SELECT *
FROM `client`
WHERE `telephone` = '0320225012'
 LIMIT 1