app/Models/CommissionOperateurModel.php

SELECT `o`.`nom` AS `operateur`, SUM(commission_operateur.commission) AS gain
FROM `commission_operateur`
JOIN `operateur` `o` ON `o`.`id` = `commission_operateur`.`operateur_destination`
GROUP BY `o`.`id`
---
    public function getGainParOperateur()
{
    return $this
        ->select('
            o.nom AS operateur,
            SUM(commission_operateur.commission) AS gain
        ')
        ->join(
            'operateur o',
            'o.id = commission_operateur.operateur_destination'
        )
        ->groupBy('o.id')
        ->findAll();