app/Models/OperationModel.php

SELECT SUM(`o`.`frais`) AS `frais`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
WHERE `t`.`nom` = 'Retrait'
---
    protected function gainParType(string $nomTypeOperation): int
    {
        $result = \Config\Database::connect()
            ->table('operation o')
            ->selectSum('o.frais')
            ->join('type_operation t', 't.id = o.id_type_operation')
            ->where('t.nom', $nomTypeOperation)
            ->get()
            ->getRow('frais');

SELECT SUM(`frais`) AS `frais`
FROM `operation`
---
    public function gainTotal(): int
    {
        $result = \Config\Database::connect()
            ->table('operation')
            ->selectSum('frais')
            ->get()
            ->getRow('frais');

SELECT `operation`.*, `type_operation`.`nom` as `type_operation`, `cd`.`telephone` as `telephone_client`
FROM `operation`
JOIN `type_operation` ON `type_operation`.`id` = `operation`.`id_type_operation`
LEFT JOIN `client` `cd` ON `cd`.`id` = `operation`.`client_destination`
WHERE   (
`operation`.`client_source` = 2
OR `operation`.`client_destination` = 2
 )
ORDER BY `operation`.`date_operation` DESC
---
public function getHistoriqueClient($idClient)
{
    return $this
        ->select('
            operation.*,
            type_operation.nom as type_operation,
            cd.telephone as telephone_client
        ')
        ->join(
            'type_operation',
            'type_operation.id = operation.id_type_operation'
        )
        ->join(
            'client cd',
            'cd.id = operation.client_destination',
            'left'
        )
        ->groupStart()

            ->where('operation.client_source',$idClient)

            ->orWhere('operation.client_destination',$idClient)

        ->groupEnd()

        ->orderBy(
            'operation.date_operation',
            'DESC'
        )

        ->findAll();