app/Models/PrefixeModel.php

    public function listePrefixes()
    {

        return $this->select('
                prefixe.*,
                operateur.nom AS operateur
            ')
            ->join(
                'operateur',
                'operateur.id = prefixe.id_operateur'
            )
            ->findAll();
---
SELECT `prefixe`.*, `operateur`.`nom` AS `operateur`
FROM `prefixe`
JOIN `operateur` ON `operateur`.`id` = `prefixe`.`id_operateur`