app/Models/PromotionModel.php

SELECT `promotion`.`pourcentage`
FROM `promotion`
 LIMIT 1
---
    public function getPourcentage(){
         $row = $this
        ->select('promotion.pourcentage')
        ->first();