app/Models/TypeMouvementModel.php

      public function getIdByNom(string $nom): ?int
{
    $type = $this->where('nom', $nom)->first();
---
SELECT *
FROM `type_mouvement`
WHERE `nom` = 'Debit'
 LIMIT 1